runs/stateful/full_paper/exp1_ttft_reduction_llama3_sglang/sglang_runs/meta-llama_Meta-Llama-3-8B-Instruct/ctx1024_out64_a16_b8_s0/sglang_bench_raw.txt
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=50121, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', model='meta-llama/Meta-Llama-3-8B-Instruct', served_model_name=None, tokenizer='meta-llama/Meta-Llama-3-8B-Instruct', num_prompts=32, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=64, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=None, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)
Waiting up to 60s for http://127.0.0.1:50121/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=50121, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', model='meta-llama/Meta-Llama-3-8B-Instruct', served_model_name=None, tokenizer='meta-llama/Meta-Llama-3-8B-Instruct', num_prompts=32, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=64, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=None, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)

#Input tokens: 17076
#Output tokens: 954
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 not set   
Successful requests:                     32        
Benchmark duration (s):                  1.31      
Total input tokens:                      17076     
Total input text tokens:                 17076     
Total generated tokens:                  954       
Total generated tokens (retokenized):    955       
Request throughput (req/s):              24.36     
Input token throughput (tok/s):          13000.13  
Output token throughput (tok/s):         726.29    
Peak output token throughput (tok/s):    564.00    
Peak concurrent requests:                32        
Total token throughput (tok/s):          13726.42  
Concurrency:                             25.31     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   1039.05   
Median E2E Latency (ms):                 1005.93   
P90 E2E Latency (ms):                    1256.54   
P99 E2E Latency (ms):                    1294.58   
---------------Time to First Token----------------
Mean TTFT (ms):                          665.48    
Median TTFT (ms):                        745.06    
P99 TTFT (ms):                           808.99    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          16.61     
Median TPOT (ms):                        12.16     
P99 TPOT (ms):                           63.35     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           12.97     
Median ITL (ms):                         8.07      
P95 ITL (ms):                            8.85      
P99 ITL (ms):                            290.03    
Max ITL (ms):                            540.91    
==================================================


  0%|          | 0/32 [00:00<?, ?it/s]
  3%|▎         | 1/32 [00:00<00:23,  1.33it/s]
 12%|█▎        | 4/32 [00:00<00:04,  5.78it/s]
 41%|████      | 13/32 [00:00<00:00, 19.99it/s]
 66%|██████▌   | 21/32 [00:01<00:00, 29.20it/s]
 84%|████████▍ | 27/32 [00:01<00:00, 35.34it/s]
100%|██████████| 32/32 [00:01<00:00, 24.59it/s]